[
   {
      "title":"/r/Canberra weekly free chat for 05 October 2018",
      "body":"Have a chat about life, the universe, and anything. Doesn't have to be Canberra related!\n\nAlso check out our [subreddit chat](https://s.reddit.com/channel/1314019_3887c9ea55c6650ef0048c0c05c020d738e1002e)!",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9levoz/rcanberra_weekly_free_chat_for_05_october_2018/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9levoz/rcanberra_weekly_free_chat_for_05_october_2018/",
      "category":""
   },
   {
      "title":"Neighbours and cars rant",
      "body":"My fucking neighbours (both sides) are always parking on the nature strip and/or blocking me in.\nFortunately I have a high clearance car so I’ve been able to drive over their edgings and gardens to get past.\n\nLast night though, they had some kind of bash and had guests parked on the road and in front of my driveway. \n\nI put my bin out as normal, (with a guest’s car blocking access to it) passive-aggressively hoping that the garbage truck will damage the car in the morning.\n\nI came out this morning and the guests cars are gone, but my bin has been moved onto the road and another, different car is now parked on the nature strip where my fucking bin was!\n\nFUCK YOU MATE, STOP FUCKING PARKING (and letting your guests park) ON MY PART OF THE NATURE STRIP!\n\nRant over I guess.",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9n4dve/neighbours_and_cars_rant/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9n4dve/neighbours_and_cars_rant/",
      "category":""
   },
   {
      "title":"Is there anything that can be done to help a neighbor's dog that appears to be abandoned?",
      "body":"There is a dog near my house that has been barking nonstop for 2 days now, day and night.\n\nApart from being annoying, it is also worrying that the owner doesn't appear to be around to care for the dog. \n\nIs there a way to get help for the dog?\n\nI don't wish to get the dog sent to the pound or anything like that, just get someone to make sure it isn't abandoned while the owners are away or something.",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9n3byu/is_there_anything_that_can_be_done_to_help_a/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9n3byu/is_there_anything_that_can_be_done_to_help_a/",
      "category":""
   },
   {
      "title":"Canberra Airport ‘Curb Side Service’ Useless",
      "body":"You will laugh at this, Qantas and Virgin Blue both have a ‘curb side service’ to assist disabled passengers. The rub is the disabled passenger needs to request the service on arrival, at the check-in counter, and it is subject to availability! Those conditions render the ‘curb side service’ useless and therefore not a service that a disabled passenger can rely upon.\n\nWhen challenged about the usefulness of their ‘curb side service’, their response was for the disabled passenger to ask a stranger for assistance. Like that is going to be successful at the airport at rush hour.\n\nBefore you comment, I have booked a car and driver to assist with luggage to the check-in counter and from the luggage carousel. \n\nWhy the airlines offer the ‘curb side service’ and set an expectation they clearly cannot meet. Why the airlines won’t just tell disabled passengers to hire themselves a driver is beyond me. Rant over. ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mxd5s/canberra_airport_curb_side_service_useless/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9mxd5s/canberra_airport_curb_side_service_useless/",
      "category":""
   },
   {
      "title":"Canberra's Koomarri disability charity off road after vandals wipe out entire fleet of cars",
      "body":"http://www.abc.net.au/news/2018-10-10/koomari-athletics-charity-targeted-vandals/10358810",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mwvdn/canberras_koomarri_disability_charity_off_road/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9mwvdn/canberras_koomarri_disability_charity_off_road/",
      "category":""
   },
   {
      "title":"Best adult gymnastics in Canberra",
      "body":"Just wondering if anyone has any experience with the adult gymnastics classes at South Canberra, Woden Valley and Canberra City gymnastics clubs.",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mxyg1/best_adult_gymnastics_in_canberra/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9mxyg1/best_adult_gymnastics_in_canberra/",
      "category":""
   },
   {
      "title":"Trashy",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9my9kr/trashy/",
      "content_url":"https://i.redd.it/k76afomi5cr11.jpg",
      "category":""
   },
   {
      "title":"I haven’t actually read why the bins haven’t been collected this week, I just love this episode and thought it timely to come across this post now.",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mpmjg/i_havent_actually_read_why_the_bins_havent_been/",
      "content_url":"https://i.redd.it/pyxkvmkzq5r11.jpg",
      "category":""
   },
   {
      "title":"Scraped and dented the bumper / front quarter panel of my car. Recommendations for a car repairer in Fyshwick?",
      "body":"As the title says, looking for a panel beater / paint fixer in Fyshwick area that's reasonably priced and does a good job.\n\nAnyone got some recommendations?",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9muvrv/scraped_and_dented_the_bumper_front_quarter_panel/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9muvrv/scraped_and_dented_the_bumper_front_quarter_panel/",
      "category":""
   },
   {
      "title":"Good Banh xeo in Canberra?",
      "body":"As the title suggests ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mnvzp/good_banh_xeo_in_canberra/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9mnvzp/good_banh_xeo_in_canberra/",
      "category":""
   },
   {
      "title":"Best bakers (birthday cake)?",
      "body":"Hi all,\n\nI've not lived in Canberra for many years, and am trying to assist a family member with organising one of those \"semi naked\" cakes for a last minute birthday party in November of this year.\n\nIt seems they've left it a bit late as the bakers they know who have good word of mouth are already booked out well into 2019.\n\nThat said a Google search seems to turn up a lot of independent bakers offering this cake style. Only problem with that is that because there is no shop you can walk into my family can't walk in and trial the cakes for quality assurance. And because there are so many of these independents it can be difficult to find many reviews.\n\nThis is a special event, & from a distance I'm trying to help my family make a delicious choice. \n\nAny recommendations would be hugely appreciated. \n\nThanks :)",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mlhjx/best_bakers_birthday_cake/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9mlhjx/best_bakers_birthday_cake/",
      "category":""
   },
   {
      "title":"Overweight truck concerns behind Canberra's bin collection delay",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mhngk/overweight_truck_concerns_behind_canberras_bin/",
      "content_url":"https://www.canberratimes.com.au/national/act/driver-concern-about-overweight-trucks-delays-rubbish-collection-20181008-p508di.html",
      "category":""
   },
   {
      "title":"CT : High churn rate of pharmacy staff 'not optimal'",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mjl69/ct_high_churn_rate_of_pharmacy_staff_not_optimal/",
      "content_url":"https://www.canberratimes.com.au/national/act/high-churn-rate-of-pharmacy-staff-not-optimal-20181008-p508gb.html",
      "category":""
   },
   {
      "title":"What's happening with the bins today? Is there a Garbo holiday today, because my bin's still chocko..",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mcnwl/whats_happening_with_the_bins_today_is_there_a/",
      "content_url":"https://i.redd.it/f6ys2msduwq11.jpg",
      "category":""
   },
   {
      "title":"Pill testing: Defqon.1 festival welcome in Canberra, ACT Greens leader Shane Rattenbury",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9m93dn/pill_testing_defqon1_festival_welcome_in_canberra/",
      "content_url":"http://www.abc.net.au/news/2018-10-08/deqon-1-festival-to-move-to-canberra-calls-greens/10343804",
      "category":""
   },
   {
      "title":"CIT Welding Short Course",
      "body":"Has anyone done the welding course offered at CIT? Would be interested to hear if it was worthwhile and not a waste of money. I am keen to learn welding for some diy projects.  https://shortcourses.cit.edu.au/courses/?cid=b145caac-6c15-5487-9f57-5b237491ebac&scid=747f7cd0-667f-c17d-b266-5b237493407e",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mdbj4/cit_welding_short_course/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9mdbj4/cit_welding_short_course/",
      "category":""
   },
   {
      "title":"University of Canberra sexual harassment review finds confusion over reporting",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mbuzl/university_of_canberra_sexual_harassment_review/",
      "content_url":"http://www.abc.net.au/news/2018-10-08/university-of-canberra-sexual-harassment-report/10351392",
      "category":""
   },
   {
      "title":"Recommend me a bathroom renovator please",
      "body":"Not sure if this sort of topic of post is welcome here.  I think I recall similar ones getting a \"try the yellow pages\" type of response.  I'm wanting to maybe be able to shortcut the gruelling process of going through a number of quotes and even then not being sure if you're paying more just to be ripped off or going cheap and going to get cheap/nasty/dodgy as a result.  I live alone so getting quotes usually means taking a bunch of time off work.",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mbq1p/recommend_me_a_bathroom_renovator_please/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9mbq1p/recommend_me_a_bathroom_renovator_please/",
      "category":""
   },
   {
      "title":"CIT students, have you ever asked for an extension and how did it go?",
      "body":"Got my diploma due 25th this month and I'm probably not going to be able to finish it in time. What are people's experiences with CIT and matters such as this?",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9mc1en/cit_students_have_you_ever_asked_for_an_extension/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9mc1en/cit_students_have_you_ever_asked_for_an_extension/",
      "category":""
   },
   {
      "title":"Kberra Bab Blog 10: Blazy's Bonus Round! Origin Turkish Kitchen (Iskender Kebab $24.70 and Baklava $8.50) A Bab and Bak review",
      "body":"*10 tasty bab reviews hangin' on the blog, 10 tasty bab reviews hangin' on the blog. I'm Blazy, and this review is gonna drop*.\n\nNow, I was thinking of something a bit special and settled on  the Iskender Kebab and Baklava, that's right! A bab and bak review! So, I didn't know what an Iskender Kebab was? I mean it has kabab in it, right? I asked my mate Sultan for a little background and he said it was bread covered by meat, sauce and yoghurt, like a Turkish nachos! \n\nI get to the restaurant, this is a restaurant similar to the Kababa near Civic bus-stop. It's got table cloths, cutlery, picture collages of Turkey and slightly too loud classical background music. It reminds me of those Italian family restaurants. I place an order and take a seat at a table, bit of a warning, you need to speak clearly and listen well to the waiter/chef so there's no misunderstandings. \n\nThe Iskender bab was turkish bread,butter, lamb kebab meat  tomato based sauce, yoghurt with tomato and parsley garnish. I didn't use my bab ruler this time, so no Bab measurements. The bread was Turkish bread, which meant the sauce was mopped up nicely. The bread was nice and not stale. The addition of the butter put the dish on the fatty side and I felt my eyes water a little, like when you eat KFC. The meat was shaved off the doner and grilled leaving a savory flavour and it wasn't too dry but it was overshadowed by the sauce. \n\nThe sauce was tomato, oregano, onion (fine chopped), garlic (I think powdered garlic) from what I could tell, though I would have liked some chili in there, lets get spicy! There was a lot of sauce, one saucy number! Although the sauciness is solved by the mopping ability of the Turkish bread. The additional sauce was yogurt which was quite nice, a little dairy to proceedings smoothing the tomato rich sauce, similar to sour cream on nachos.\n\nI'd have added some chili on top or put some chili in the sauce and would have spiced the meat as I was grilling it.  I would have also dialed back on the butter a little. \n\nNow, on to the bak (baklava) which is thin filo pastry layers with nuts and syrup/honey, like a sweet lasagna. They make their bak in store, good on them! I got two bak pieces, strawberries (no needles), some choccy ice cream and a drizzle of honey. I have little experience in bak reviews so I got this quote from a sixth generation bak maker in Turkey.  *\"The cracking sound is the sign of freshness, a sign of the finest  baklava; a must for us. Good baklava leaves a heavenly taste in your mouth; it shouldn’t be very sweet and heavy; on the contrary it should  be light enough to tempt you to eat a small plateful.”* I'll use this quote as the basis of my bak review.\n\nI got the crackling sound on the top part but not the lower layers, which could be because of the honey. The pastry had a nice savory buttery flavour, the nuts were peanut I think, and could have been a bit more tasty, I wondered about using pistachios instead. The honey was quite nice and gave a sweet touch. The sweetness especially on the bottom was a little overpowering sometimes, so I didn't eat the strawberries and ice cream. I think that the bak was sitting and taking in some of the honey, leading to the bottom being overly sweet\n\nSo, looking that the quote by the bak maker. It had a cracking sound but not in the bottom layers. The taste was a mix of buttery,savory and sweet. I'd say it was a little too sweet and slightly uneven and I wasn't tempted to eat more. \n\nFinally, let's look at prices. The price for the Iskender bab is $24.70 which is definitely too much, it fills you up but I wouldn't pay that much for it at all! The bak was $8.50 which I'd say is reasonable for what you get. I'd rate the Iskender bab a 2/5 an average review. It's a nice change from babs but it's too expansive for what I got taste wise. The bak I'd give a 3/5 an above average review, it was homemade and tasty but a bit too heavy and sweet to stand really stand out.\n\nThanks for being with me on my 10th review my fine Bab Brigade. I have enjoyed doing these reviews and I like the discussion that grows from them. \n\nThanks all. \n\nBlazy, \n\nNote: [https://ozlemsturkishtable.com/2013/07/baklava-101-from-the-masters-tips-to-make-the-real-thing-at-home/](https://ozlemsturkishtable.com/2013/07/baklava-101-from-the-masters-tips-to-make-the-real-thing-at-home/) This is the site I got the quote from! \n\n[Out the front](https://i.redd.it/lkqq74yigqq11.jpg)\n\n&#x200B;\n\n[The restaurant](https://i.redd.it/vzbf2kr0hqq11.jpg)\n\n \n\n[Iskender Bab](https://i.redd.it/70aoshzshqq11.jpg)\n\n&#x200B;\n\n[Bak](https://i.redd.it/1hgtsk6biqq11.jpg)\n\n&#x200B;\n\n[Bak nut layer](https://i.redd.it/jwvfowczkqq11.jpg)",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9m446x/kberra_bab_blog_10_blazys_bonus_round_origin/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9m446x/kberra_bab_blog_10_blazys_bonus_round_origin/",
      "category":""
   },
   {
      "title":"Reddit meetup tonight 8pm @ Reload!",
      "body":"Hey everyone! \n\nJust a reminder about the Reddit meetup tonight starting at 8pm at Reload bar in the city. \n\nUnfortunately I won't be able to make it due to a family emergency and am out of town, but our fearless moderator Watzy will be there. \n\nHope you all have an excellent time and get some good gaming in! ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9ltujn/reddit_meetup_tonight_8pm_reload/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9ltujn/reddit_meetup_tonight_8pm_reload/",
      "category":""
   },
   {
      "title":"Sewing or Knitting Service",
      "body":"Does anyone know of any place I could go in Canberra to get a small piece of clothing made, either out of cloth or knitted.\n\nI have a small stuffed toy that is missing it's shirt and I am looking for a service where I can get a shirt made for it.\n\nI am after somewhere that I can give specifications of what I want (and a photo/colour choice) and get them to make it for me. Either from cloth sewing or knitting something.\n\nAny help appreciated thanks.",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lu8n9/sewing_or_knitting_service/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lu8n9/sewing_or_knitting_service/",
      "category":""
   },
   {
      "title":"Kabuki tonight",
      "body":"If you're looking for something different to do this evening (or tomorrow afternoon), I highly recommend the ANU Kabuki performance (traditional Japanese drama).  \n\n$15 ($10 for students) at ANU Theatre 3. Doors open at 6 pm tonight and 1 pm tomorrow, you can get tickets at the door (so long as there are some left) or via qpay.\n\nMore info here:\nhttp://www.anu.edu.au/events/the-remembered-mother\n\nand here\nhttps://www.facebook.com/events/2209706055918213/\n\nThis year's performance is really good. Lead actor is amazing.\n\n[Canberra Times did a piece on it here](https://www.canberratimes.com.au/national/act/it-s-traditional-japanese-theatre-but-with-a-modern-anu-twist-20181004-p507qa.html)\n\n(edit: included add'l link)",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lsuop/kabuki_tonight/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lsuop/kabuki_tonight/",
      "category":""
   },
   {
      "title":"Alteration service?",
      "body":"Hey canberra, \n\nI have a dress that I need altered. I need the sleeves removed and probably some darts put in the side to bring in the arm-holes as the dress is too wide at the shoulders + arm-holes. Does anyone know an alteration place that is reasonable and trustworthy? I’ve no idea what kind of price to expect for such a service, especially with, y’know, the Canberra tax 😫 Any help much appreciated! ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lvdt5/alteration_service/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lvdt5/alteration_service/",
      "category":""
   },
   {
      "title":"Where to buy cigars?",
      "body":"As the title suggests, where can i get cigars in canberra?",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lv8ip/where_to_buy_cigars/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lv8ip/where_to_buy_cigars/",
      "category":""
   },
   {
      "title":"Has anyone got the new Mario party game! I'd love to come play - I'm new to Canberra and don't have a console!",
      "body":"So keen to try it out. Pm me! ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9ltdts/has_anyone_got_the_new_mario_party_game_id_love/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9ltdts/has_anyone_got_the_new_mario_party_game_id_love/",
      "category":""
   },
   {
      "title":"Recommendations for Italian restaurant",
      "body":"My little brother and family are coming up to Canberra for his 18th next weekend. We were thinking something like Italian and Sons but keen for any recommendations.",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lteok/recommendations_for_italian_restaurant/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lteok/recommendations_for_italian_restaurant/",
      "category":""
   },
   {
      "title":"This 'catch' is from Canberra",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9llbll/this_catch_is_from_canberra/",
      "content_url":"https://imgur.com/BOTCLxP",
      "category":""
   },
   {
      "title":"Does the RELOAD Bar ever hold N64 Mario Kart or Smash Bros Competitions?",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lryji/does_the_reload_bar_ever_hold_n64_mario_kart_or/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lryji/does_the_reload_bar_ever_hold_n64_mario_kart_or/",
      "category":""
   },
   {
      "title":"PSA: Individual Tax Returns are due 31 October. Also, ask me questions about tax!",
      "body":"Hi everyone -  don't forget that unless you use a tax agent, tax returns are due very soon! Personal tax returns are due 31 October, unless you are otherwise notified by the ATO.\n\nA tax agent may have access to a concessional lodgement programme, which can be as late as 15 May 2019. To get access to this, make sure you have appointed a tax agent before the normal due date and that they have added you to their lodgement list.\n\nAs per the past years, if anyone has any general questions on tax queries. I'd be happy to answer.\n\nUsual caveats apply: Comments below are of a general nature only. This is not professional/personalised advice, make sure you personally verify comments made here and seek professional advice where appropriate/necessary to your personal specific situation.\n\nAbout me: I'm a CA with a local firm with about 5 years experience, primarily serving the Small-Medium Enterprise space. We don't specialise in individual tax returns but we do have a small number of individual clients, and we do quite a lot of individual returns as part of a business/family group.\n\nIf you are studying accounting and are interested in being an accountant I'm also happy to answer some questions about the industry.",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9ll0wi/psa_individual_tax_returns_are_due_31_october/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9ll0wi/psa_individual_tax_returns_are_due_31_october/",
      "category":""
   },
   {
      "title":"Best coeliac bars/pubs",
      "body":"Its not that I'm a cunt who doesnt eat it but I'm allergic to gluten, and beer legit makes me die.. Does anyone know which pubs have the best or largest variety of cider on tap? I mean or gluten free beer but that's unlikely xD\n\nCheers",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lmwzn/best_coeliac_barspubs/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lmwzn/best_coeliac_barspubs/",
      "category":""
   },
   {
      "title":"Where to watch the UFC229 Connor McGregor fight today?",
      "body":"Hi, I’m in Canberra today and am looking for somewhere to watch the fight. Any recommendations please?",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lqtbu/where_to_watch_the_ufc229_connor_mcgregor_fight/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lqtbu/where_to_watch_the_ufc229_connor_mcgregor_fight/",
      "category":""
   },
   {
      "title":"Dungeons and dragons?",
      "body":"Anyone keen to get into a dungeons and dragons campaign? We are looking at alternate thursday nights, between 7 and 10? Let me know!",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lkto6/dungeons_and_dragons/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lkto6/dungeons_and_dragons/",
      "category":""
   },
   {
      "title":"Carnivore in Canberra - where to eat?",
      "body":"If I just want to eat meat - brisket, pork belly, pulled pork etc where is a good place? I’ve checked out restaurants online but there doesn’t seem to be a bbq / smoked meat place in Canberra. Any suggestions?",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lixws/carnivore_in_canberra_where_to_eat/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lixws/carnivore_in_canberra_where_to_eat/",
      "category":""
   },
   {
      "title":"Does our boy Slazo subscribe to the Canberra subreddit?",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lsrzw/does_our_boy_slazo_subscribe_to_the_canberra/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lsrzw/does_our_boy_slazo_subscribe_to_the_canberra/",
      "category":""
   },
   {
      "title":"Wova gets green light… the rise and rise of Geocon continues apace",
      "body":"[Geocon's Wova development given green light](https://www.canberratimes.com.au/national/act/geocon-s-wova-development-given-green-light-20181004-p507sl.html)\n\n* $400m development in Woden\n* 4 buildings\n* 789 apartments\n* 2650m2 of commercial space\n\nIf/when Geocon falls it's going to screw a lot of people over.\n\nWith talk of lending getting tougher and residential real estate values on a downward trend, are we getting closer to when and removing the if?\n\nThat aside, Woden could do with an injection of new development, but there's already a fair bit planned or underway. How much is enough?\n\nPerhaps that's a question for Geocon as well.",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lhp3c/wova_gets_green_light_the_rise_and_rise_of_geocon/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lhp3c/wova_gets_green_light_the_rise_and_rise_of_geocon/",
      "category":""
   },
   {
      "title":"Pubs showing UFC this sunday?",
      "body":"Any pubs showing the UFC this Sunday in civic? Specifically Connor VS Khabib? thanks",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9liumj/pubs_showing_ufc_this_sunday/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9liumj/pubs_showing_ufc_this_sunday/",
      "category":""
   },
   {
      "title":"For those in Canberra who want to play some DnD but dont have a group/time :) Come play! Mostly one shots so far and we've been sharing our adventures in podcast form",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9la6xi/for_those_in_canberra_who_want_to_play_some_dnd/",
      "content_url":"https://www.reddit.com/r/rpg/comments/9jjjvm/aussies_and_dragons_dd_podcast/",
      "category":""
   },
   {
      "title":"Is there a Men's/ homeless shelter in the ATC that would take mildly used bottles of body wash?",
      "body":"I recently moved from out of country in with my partner and discovered he has quite the collection of body wash he doesn't use or need. Rather than throw them away, I would like to donate if possible.\n\nEdit: ACT\\*\\* not ATC...",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9l9s7w/is_there_a_mens_homeless_shelter_in_the_atc_that/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9l9s7w/is_there_a_mens_homeless_shelter_in_the_atc_that/",
      "category":""
   },
   {
      "title":"What outdoor activity do you do on a regular basis in Canberra?",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9l6xd2/what_outdoor_activity_do_you_do_on_a_regular/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9l6xd2/what_outdoor_activity_do_you_do_on_a_regular/",
      "category":""
   },
   {
      "title":"Fake honey in Australia. Where to get good pure Canberran honey?",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9l0g2l/fake_honey_in_australia_where_to_get_good_pure/",
      "content_url":"https://www.smh.com.au/business/consumer-affairs/fake-honey-scandal-widens-to-australian-sourced-brands-20181002-p507ar.html",
      "category":""
   },
   {
      "title":"Anyone with a Costco membership and needs to go to Costco tomorrow want a lift there?",
      "body":"I need to pick some stuff up for work but I don't have a membership, I'm fighting with the person I usually go to Costco with and we're not on speaking terms.\n\nI can pick you up from anywhere north of Mawson, take you to Costco and drop you off anywhere not Southside, I'll buy you food or a coffee",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9l0zjw/anyone_with_a_costco_membership_and_needs_to_go/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9l0zjw/anyone_with_a_costco_membership_and_needs_to_go/",
      "category":""
   },
   {
      "title":"ACT Pretty Girls Fyshwick review NSFW",
      "body":"For the punters to be, and those curious about the sex trade in Canberra I will be (re)visiting all the certified bordellos in Canberra and writing a review about my experiences there.\n\nTonight I had the pleasure of visiting ACT Pretty Girls in Fyshwick. The enterance is not discreet at all, and due to Fyshwicks status as a mini red light district at night and generally busy anyway throughout the day do not expect privacy going in and out.\n\nACTPG are really busy at night time, however they do a good job at staggering arriving clients and placing them in individual waiting rooms as to avoid awkwardness, Complimentary drink of your choice is also provided.\n\nThe ladies are very lovely, and ACTPG boasts a large roster of ladies to choose from so even on a busy night you're guaranteed to have a good selection.\n\nThe ladies look young, all the ladies looked to be around 25 or younger. Not a lot of variety in age which depending on your taste is either good or bad. \n\nThe room itself was spacious, clean and at a nice temperature, there were no electrical issues at all with the lights but the shower had a really sensitive tap, it was hard to set the water to a comfortable temperature.\n\nThe bed was comfy and not noisy at all, however the walls were not soundproofed so I could hear other clients in other rooms, The ladies play music to counter this.\n\nAll in all, a satisfactory experience. 8/10\n\nNext time I'll be visiting Mitchell so stay tuned for my next post\n\n\n",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9lb6fk/act_pretty_girls_fyshwick_review_nsfw/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9lb6fk/act_pretty_girls_fyshwick_review_nsfw/",
      "category":""
   },
   {
      "title":"Premiere of \"The Diggers' Requiem\" - Oct 6th, 7:30pm, Llewellyn Hall. Tix $25-$65",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9l0t84/premiere_of_the_diggers_requiem_oct_6th_730pm/",
      "content_url":"https://www.awm.gov.au/commemoration/armistice/Diggers-Requiem",
      "category":""
   },
   {
      "title":"Delivery Drones",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9kxd7x/delivery_drones/",
      "content_url":"https://www.canberratimes.com.au/national/act/delivery-drones-to-fly-permanently-in-act-despite-community-concerns-20181003-p507gi.html",
      "category":""
   },
   {
      "title":"Where’s Wally spotted in the ACT",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9kpv5g/wheres_wally_spotted_in_the_act/",
      "content_url":"https://i.redd.it/5d5yj4buerp11.jpg",
      "category":""
   },
   {
      "title":"If someone is missing a rabbit in the city area - it's hanging out at the carousel",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9kolcu/if_someone_is_missing_a_rabbit_in_the_city_area/",
      "content_url":"https://i.redd.it/m5wiec6s4qp11.jpg",
      "category":""
   },
   {
      "title":"Snek season is go! Eastern Brown near Fassifern Pond, Dunlop this afternoon",
      "body":"",
      "is_video":true,
      "post_url":"www.reddit.com/r/canberra/comments/9kns5h/snek_season_is_go_eastern_brown_near_fassifern/",
      "content_url":"https://v.redd.it/2xkatxwocpp11",
      "category":""
   },
   {
      "title":"Flying alarm clocks at 114db",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9kfcqz/flying_alarm_clocks_at_114db/",
      "content_url":"https://i.redd.it/bccdsam63kp11.jpg",
      "category":""
   },
   {
      "title":"Okay which one of you did this?",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9kdwwn/okay_which_one_of_you_did_this/",
      "content_url":"https://i.redd.it/7ki2nm1koip11.jpg",
      "category":""
   },
   {
      "title":"Kambah Pool Canberra nudist part",
      "body":"I sometimes go to Kambah Pool - the nude part. As a young, straight, kind of shy guy I'll go to the only place I can go to enjoy some sun in the nude and read a book - I don't have backyard at home. I just love sun and sand and wish more of it was culturally acceptable.\n\nAnyway, the amount of guys that were wandering around, gawking, fully clothed, on the dunes behind the pool while I was in my birthday suit was really off putting. One guy was dressed in a black hoodie and sunglasses on a 23 degree day in high noon, it was super creepy!\n\nTwo guys - maybe a gay couple, came fully clothed, set up behind me and chilled out on the beach, commenting on what a good spot it was. They left 5 mins later. \n\nI mean if you are fully clothed - why not check out the other side of Kambah Pool, the clothed area? It's just as nice and been there before. It just seems like there's a lot of creepiness there, I wish nudist places didn't have to be.\n\nHas anyone had similar experiences with Kambah Pools (nude part), is it just me being a bit crazy? :)\n\n ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9kf8tt/kambah_pool_canberra_nudist_part/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9kf8tt/kambah_pool_canberra_nudist_part/",
      "category":""
   },
   {
      "title":"Graphic designer looking for a job",
      "body":"Hello Canberrans! Anyone here know of a Graphic design job that I can apply to? Been trying to apply online for 2 months now but no luck :( \n\nI was an Art director / Senior graphic designer in Singapore for 7 years doing print/web designs.\n\nJust trying my luck here. please send me a pm if you know of any. \n\nThank you! ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9kg1sr/graphic_designer_looking_for_a_job/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9kg1sr/graphic_designer_looking_for_a_job/",
      "category":""
   },
   {
      "title":"Any recommendations for a urologist in the ACT?",
      "body":"My elderly relative would like a second opinion re his prostate problems. He hasn't had a good experience with one provider in the past and would like to try someone else, who is caring and competent!\n",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9kcpol/any_recommendations_for_a_urologist_in_the_act/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9kcpol/any_recommendations_for_a_urologist_in_the_act/",
      "category":""
   },
   {
      "title":"Kberra Bab Blog 9: Turkish Halal Pide House (Turkish Kebab Roll $12)",
      "body":"*His palms are sweaty, hands full, meat is heavy. There's sauce on this face already: Yarra's Ke-babby!*\n\nHi Bab brigade! It's Blazy here with another review for you. The review is.....  You guessed it, Yarra babs! There's been songs, requests and everyone mentions it when you talk about it on the street, so I decided to take the plunge. I rocking up at Friday at 6:45pm before the long weekend, what a way to kick things off!\n\nI walk in and there's about 20-25 people in there, it lives up to it's reputation! They have an area where you fill out what you want on your bab and then you hand it to the staff, some of the OB's (original babbers) showed me how it's done. I got a lamb kebab roll with lettuce, tomato, onion, tabbouleh, cheese, chili sauce and humus, loadin up. As they made my bab I looked around, they were carving and storing it in a bain-marie and using it quickly, they also toasted the bab to finish. \n\nI went outside and measured it to 8cm width, one of the bigger ones so far, serious girth. The bab was very well wrapped, so well wrapped, it was straight out of Compton! I had to unwind it ,bit by bit, bite by bite and there was no spillage at all. You look at the bab you see meat, meat and more meat. The meat is quite satisfying and has a nice savory flavour to it, although it is on the fatty side. It's the good kind of fatty, like crackling and it wasn't under cooked at all. \n\nThe veggies and cheese were ok, though I recommend getting the tabbouleh as the sharp parsley flavour really helps to balance out the meaty fattiness nicely. There's definitely a high amount of meat to the veggies, I reckon a bit more veggies wouldn't go a miss but I respect their commitment to meat. The sauce is there and is tasty but the chili was a little sparse, they may be intentionally going sparse to showcase the meat or catering to local tastes but I wanted more chili! \n\nThis meaty bab will definitely fill you up and it is fair value compared to other babs. They do have a $15 EFTPOS limit but they waved that with me, so just be aware of that if you pay by card. I like the place,  it reminds me of a suburban pizza joint though with a hearty dose of Turkish flair. \n\nNow, this review was challenging, very challenging for me. I was torn between 3-4 stars. The bab is generous meat wise, well wrapped and fills you up nicely. The veggies balance things out but more would make i just right. The sparse chili sauce is an issue, a good coverage of sauce is a must. Overall,the bab is about 3.5 but the atmosphere, the look and feel was exciting and it was nice to see fellow babbers in there.  I will give it a 4/5 because of the whole package. I saw that they had chili paste and I should have added that to the mix. This is a solid kebab all round and I'd be up for another review of this one in less busy circumstances to see if the sauce issues are dealt with. \n\nBlazy's note: I'd be up for a couple more reviews here to work out consistency, busy vs not busy and also how lax they are about the EFTPOS limit, as a $15 limit will force you to get a drink. I was conscious of the hype factor and It'd be good to try it a second time to see how it holds up to this review. \n\nSee ya! \n\nBlazy, \n\n&#x200B;\n\n[The outside! Check out all the people](https://i.redd.it/zvaxv6w1ddp11.jpg)\n\n&#x200B;\n\n[Kebab area and instrutions \\(for you all\\) ](https://i.redd.it/lx7o3j49ddp11.jpg)\n\n&#x200B;\n\n[Meat storage](https://i.redd.it/kwbe6n2pddp11.jpg)\n\n&#x200B;\n\n[The bab with my bab ruler! ](https://i.redd.it/0r0kawdsddp11.jpg)\n\n&#x200B;\n\n&#x200B;\n\n[Look at the wrap and the meat! ](https://i.redd.it/2o7d91qefdp11.jpg)\n\n[Check that meat out ](https://i.redd.it/aaa41so9fdp11.jpg)",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9k6bon/kberra_bab_blog_9_turkish_halal_pide_house/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9k6bon/kberra_bab_blog_9_turkish_halal_pide_house/",
      "category":""
   },
   {
      "title":"Belconnon mall at 11pm",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9k2rrp/belconnon_mall_at_11pm/",
      "content_url":"https://i.redd.it/zrgtrim6gap11.jpg",
      "category":""
   },
   {
      "title":"Sunday jamming sesh with Donald The Maggie.",
      "body":"I've been feeding a young Magpie that's been visiting over the last few weeks. Today he followed me around the garden and started singing. I whistled back and he sang to me! Maggies are the best. :)\n\nhttps://reddit.com/link/9k4w43/video/70ufmi7gccp11/player",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9k4w43/sunday_jamming_sesh_with_donald_the_maggie/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9k4w43/sunday_jamming_sesh_with_donald_the_maggie/",
      "category":""
   },
   {
      "title":"What is a fun thing to do in Canberra that I don't know about yet?",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9k40zy/what_is_a_fun_thing_to_do_in_canberra_that_i_dont/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9k40zy/what_is_a_fun_thing_to_do_in_canberra_that_i_dont/",
      "category":""
   },
   {
      "title":"Is there any outdoor basketball courts with nets in Canberra?",
      "body":"Melrose high - No\nBelconnen stadium - no\nMacKillop high - no \nErindale - no",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9k4hbu/is_there_any_outdoor_basketball_courts_with_nets/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9k4hbu/is_there_any_outdoor_basketball_courts_with_nets/",
      "category":""
   },
   {
      "title":"Canberra has fastest internet speeds in the country, analysis shows",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9k0s1q/canberra_has_fastest_internet_speeds_in_the/",
      "content_url":"https://www.canberratimes.com.au/national/act/canberra-has-fastest-internet-speeds-in-the-country-analysis-shows-20180928-p506kv.html",
      "category":""
   },
   {
      "title":"Who is the best internet provider?",
      "body":"I'm moving out of home to Melba in the next week or so and need to find internet plans, what ISP has the best price and speeds for the NBN?? ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9k2bt9/who_is_the_best_internet_provider/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9k2bt9/who_is_the_best_internet_provider/",
      "category":""
   },
   {
      "title":"I see this every. single. day.",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9juoyw/i_see_this_every_single_day/",
      "content_url":"https://i.redd.it/kmew5os7q4p11.jpg",
      "category":""
   },
   {
      "title":"QBN 96.7",
      "body":"I no longer seem to be able to stream this station. From a couple of different ISPs I get the impression it has dropped off the DNS records. Or is it just me?",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9k0sv6/qbn_967/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9k0sv6/qbn_967/",
      "category":""
   },
   {
      "title":"Water treatment in Canberra?",
      "body":"Anyone happen to know how the tap water is treated in Canberra (chlorine, chloramine, something else?)",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jwvcz/water_treatment_in_canberra/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9jwvcz/water_treatment_in_canberra/",
      "category":""
   },
   {
      "title":"At least 387 dead, and this is the CT headlines....",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9k1a6m/at_least_387_dead_and_this_is_the_ct_headlines/",
      "content_url":"https://i.imgur.com/LC7GhLU.png",
      "category":""
   },
   {
      "title":"Why trackless trams are ready to replace light rail",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9k13u3/why_trackless_trams_are_ready_to_replace_light/",
      "content_url":"https://theconversation.com/amp/why-trackless-trams-are-ready-to-replace-light-rail-103690",
      "category":""
   },
   {
      "title":"This belongs here",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jmjbd/this_belongs_here/",
      "content_url":"https://i.redd.it/texv68eotyo11.jpg",
      "category":""
   },
   {
      "title":"DJ ALBO, one night only! I hope they have pill testing!",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jmf5h/dj_albo_one_night_only_i_hope_they_have_pill/",
      "content_url":"https://imgur.com/a/7LPe0tD",
      "category":""
   },
   {
      "title":"My response letter from MG regarding the Curtin shops redevelopment.",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jifmr/my_response_letter_from_mg_regarding_the_curtin/",
      "content_url":"https://i.imgur.com/0AlD0WG.jpg",
      "category":""
   },
   {
      "title":"CT:Canberra Hospital pharmacy at 'crisis point'",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jinds/ctcanberra_hospital_pharmacy_at_crisis_point/",
      "content_url":"http://www.canberratimes.com.au/national/act/canberra-hospital-pharmacy-at-crisis-point-20180926-p5066t.html",
      "category":""
   },
   {
      "title":"Cotter River this morning - a quick edit.",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jj2vo/cotter_river_this_morning_a_quick_edit/",
      "content_url":"https://youtu.be/TSrQXWDLqFc",
      "category":""
   },
   {
      "title":"How much longer will Gundaroo Drive be a traffic nightmare?",
      "body":" It's been nearly 2 years since work was started on the Gundaroo Drive duplication and it is still far from competition. I am a patient person but this is simply ridiculous. The endless traffic changes. The sudden changes in road level that are not even signposted!  What the fuck is going on? Who is in charge?  When can we expect to have our road back? \n\nI simply avoid the area whenever possible. The suspension of my car can't take the abuse any more. ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jgs5h/how_much_longer_will_gundaroo_drive_be_a_traffic/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9jgs5h/how_much_longer_will_gundaroo_drive_be_a_traffic/",
      "category":""
   },
   {
      "title":"Dear texting and driving Canberrans:",
      "body":"You lot are addicted to your phones. I haven't driven in a long while (walk to work) and drove my car out to an appointment today in peak hour. Literally every second person was blatantly on their phone. Now, I don't mind the old hold-er-up-to-yer-ear-on-loudspeaker phone call usage. That's not that bad. I get it, not all of us have bluetooth or whatever. \n\nWhat I'm talking about is straight up scrolling social media, texting, watching videos, snapchat, you name it. I had 2 nearly-accidents with people today in just ten minutes of driving, both on their phones, both totally oblivious to what nearly happened. Riding my bike through town the other day, bloke in front of me in an AMG Mercedes jumps on the brake all of a sudden for no reason - literally both hands on his phone, eyes staring straight at it. Nothing any of you are doing is that important. There's so much more to life than your fucking phone.\n\nIn general... I think we all have a lot of work to do in getting *un*phone-addicted. But can we please work on it *right now* in terms of driving? It's fucked and it's not good enough. You're throwing a 2-tonne brick at people with your eyes closed. That's a dick move.",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jcfel/dear_texting_and_driving_canberrans/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9jcfel/dear_texting_and_driving_canberrans/",
      "category":""
   },
   {
      "title":"Any DnD games starting tonight that I can drop in to?",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jlxwf/any_dnd_games_starting_tonight_that_i_can_drop_in/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9jlxwf/any_dnd_games_starting_tonight_that_i_can_drop_in/",
      "category":""
   },
   {
      "title":"Getting a job in Canberra?",
      "body":"Hey guys, I’m most likely moving to Canberra from Melbourne around February next year for study/family. \n\nWhat’s it like difficulty wise to get a job there as a young 20’s student? I will have a Cert IV of Bookkeeping under my belt and I have a lot of admin, bookkeeping,reception, and customer service experience- so hoping to  get something in that area.\n\nMy boyfriend and some of his friends have said that it’s fairly easy to get a job in Canberra as a student. Is it? I’m just so worried about being able to rent etc as soon as I arrive. \n\nTD LR: what’s the difficulty of getting a job in Canberra as a student? (As a person coming from Melbourne where like 6 billion people apply to jobs)\n\nThanks for your replies! ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jkdcx/getting_a_job_in_canberra/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9jkdcx/getting_a_job_in_canberra/",
      "category":""
   },
   {
      "title":"Construction giant Geocon offers to match deposits as presence grows",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jhjyk/construction_giant_geocon_offers_to_match/",
      "content_url":"https://www.smh.com.au/national/act/construction-giant-geocon-offers-to-match-deposits-as-presence-grows-20180926-p5063l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
      "category":""
   },
   {
      "title":"NSW/ACT double demerits start tomorrow",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jcov0/nswact_double_demerits_start_tomorrow/",
      "content_url":"https://www.news.com.au/finance/money/costs/double-demerits-huge-fines-in-place-in-nsw-act-this-long-weekend/news-story/01fa07e1a5b4eabe5a82a953602183d0",
      "category":""
   },
   {
      "title":"What have these idiots done to Drake Brockman drive?",
      "body":"It use to be 60km up to Cussen st, then a nice step up to 70 then 80 toward William hovel drive.\n\nAfter these morons painted the new lines in twice because they forgot to put space in for death wish bicyclists to ride, and completely destroyed the flow of traffic by putting islands next to bus stops, they have now just marked the whole road 60. \n\nCan someone give me a logical reason as to why a good straight road near no houses and open space is now 60kph?\n\nAlso, why has the coppins crossing intersection taken so long to complete? If it’s the same dipshits doing drake brockman then they need their arses kicked. \n\nDriving in Canberra is bad enough with dc plates, tailgaters, slow old cunts that think 40 is 80 without having roadworks every two fucking seconds.\n\nSerious question.\n>edited stuff\n\n",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jajtd/what_have_these_idiots_done_to_drake_brockman/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9jajtd/what_have_these_idiots_done_to_drake_brockman/",
      "category":""
   },
   {
      "title":"/r/Canberra weekly free chat for 28 September 2018",
      "body":"Have a chat about life, the universe, and anything. Doesn't have to be Canberra related!\n\nAlso check out our [subreddit chat](https://s.reddit.com/channel/1314019_3887c9ea55c6650ef0048c0c05c020d738e1002e)!",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jfqaf/rcanberra_weekly_free_chat_for_28_september_2018/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9jfqaf/rcanberra_weekly_free_chat_for_28_september_2018/",
      "category":""
   },
   {
      "title":"Best Archery Club/Range Canberra",
      "body":"Wondering if anyone here has any experience with archery clubs around here, especially any more advanced archers, and the good and bad of them. Specifically thinking the Tuggeranong and Lyneham ranges, and interested if anyone has any experience with coaching. Cheers",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9jblqx/best_archery_clubrange_canberra/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9jblqx/best_archery_clubrange_canberra/",
      "category":""
   },
   {
      "title":"Please remove if against the rules, but does anybody here want a free 6 seater couch?",
      "body":"https://imgur.com/a/yT7h9Km\n\nHas been used by dogs so could use a good clean with some fabric cleaner or a steamer but is in useable condition. The seats recline too :) \n\n\nNothing wrong with it, just come into a little bit of money recently so I am treating myself to a new one and feel like offering it to someone in need would be a good use. Would have to be pick up only as I only have a Sedan. ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9j89gr/please_remove_if_against_the_rules_but_does/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9j89gr/please_remove_if_against_the_rules_but_does/",
      "category":""
   },
   {
      "title":"best shoe repair in canberra?",
      "body":"the problem is rubber...",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9j980s/best_shoe_repair_in_canberra/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9j980s/best_shoe_repair_in_canberra/",
      "category":""
   },
   {
      "title":"Westfield Woden announces $21 million investment in dining on Bradley Street",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9j0bz0/westfield_woden_announces_21_million_investment/",
      "content_url":"https://www.canberratimes.com.au/national/act/westfield-woden-announces-21-million-investment-in-dining-on-bradley-street-20180925-p505xj.html",
      "category":""
   },
   {
      "title":"Telopea parking?",
      "body":"If I could get to Telopea free parking by 7:30, would that be early enough to get a park? ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9j27de/telopea_parking/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9j27de/telopea_parking/",
      "category":""
   },
   {
      "title":"Floriade in bloom",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9ivuka/floriade_in_bloom/",
      "content_url":"https://i.redd.it/ksv4p6wy3go11.jpg",
      "category":""
   },
   {
      "title":"Will hire someones house for a Party (good rate$$)",
      "body":"Want to make alot of cash in one night?\n\nAnyone have a house to hire for 1 night for a party (no alcohol). Needs to have somewhat of a backyard and a bed. Will pay good money and will pay for cleaners afterwards. ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9ir0lu/will_hire_someones_house_for_a_party_good_rate/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9ir0lu/will_hire_someones_house_for_a_party_good_rate/",
      "category":""
   },
   {
      "title":"NV1 question",
      "body":"Is part of applying for a NV1 clearance including your housemates living and travel details from the last 10 years? My housemate is applying and wants these details but I can't see it listed in the nv1 fact sheet as necessary documents and don't want to give out such personal details. Thoughts? ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9illej/nv1_question/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9illej/nv1_question/",
      "category":""
   },
   {
      "title":"Floriade in October this year",
      "body":"Hi Guys, \n\nWe are planning to visit Floriade the weekend of October 6 and 7 - coming from Sydney.  I was wondering if it would still be an excellent time to see the blooms or are we going to be too late? I noticed that the Nightfest ends on 30th of September this year. Is the end of September typically the peak season? \n\nThanks ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9ihrtp/floriade_in_october_this_year/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9ihrtp/floriade_in_october_this_year/",
      "category":""
   },
   {
      "title":"Is there a way I can get a part time or casual job with video production/video editing?",
      "body":"So my passion lies with video production/video editing, but the main problem is that I have only done a small amount of paid work in this area. I made a few videos 2 years ago, for Aussie 3D, he wanted a few videos where he ranked 3D printers and it was essentially a promotional video to advertise his company. Some sound work was required to clean up and also sync audio from multiple sources. Nothing too crazy in the editing, just clean cuts and transitions, and a professional feel.\n\n&#x200B;\n\nThe only work I've done since is for my own personal videos, which is me talking in front of a camera, with a green screen behind me. In terms of editing, I use Sony Vegas 15 and Izotope to clean up audio. I have yet to do any animation work, such as in Blender. I use GIMP to edit photos.\n\n&#x200B;\n\nI understand most of my videos are fairly basic in terms of what editing is required, but I am more than willing to learn how to use both Photoshop and Adobe Premier/After Effects, but obviously this would take a bit of time.\n\n&#x200B;\n\nGiven all that, I don't expect to get full time work immediately, and would be happy to do part time/casual work while I build up the required skills. How would I go about finding a company? Or at the very least who to contat at a company so I can at least find out what the requirements are and to then build toward them?",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9ie0qc/is_there_a_way_i_can_get_a_part_time_or_casual/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9ie0qc/is_there_a_way_i_can_get_a_part_time_or_casual/",
      "category":""
   },
   {
      "title":"Eyebrow Threading",
      "body":"I'm in desperate need of somewhere to get my brows done, preferably around Kingston. Any recommendations would be most appreciated!",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9icv5e/eyebrow_threading/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9icv5e/eyebrow_threading/",
      "category":""
   },
   {
      "title":"Canberra Racecourse development plans for light rail route",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9iei1p/canberra_racecourse_development_plans_for_light/",
      "content_url":"https://www.canberratimes.com.au/sport/racing/canberra-racing-development-looks-to-ride-on-back-of-light-rail-20180921-p5056v.html",
      "category":""
   },
   {
      "title":"Are you bushfire ready? More than 20,000 homes in the capital are at risk, the ACT Emergency Services Agency warns",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9i9p60/are_you_bushfire_ready_more_than_20000_homes_in/",
      "content_url":"https://www.theage.com.au/national/act/are-you-bushfire-ready-20180923-p505j5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
      "category":""
   },
   {
      "title":"Kberra Bab Blog 8: Origin Kebabs (Large Lamb Kebab $9:50)",
      "body":"*I was made for 'viewin' you, 'babby! I was made for 'viewin' you!*\n\nKiss and babs, you know it! Hello Bab Brigade, it's Blazy with another review at Origin Kebabs out in Majura Park. I got myself a large lamb bab with lettuce, tomato, onion, carrot  and chili and tomato sauces. The large lamb bab came with two sauces, so I loaded up, cause I'm a saucy one!\n\nI chomped this bab in my car, so get your fluffy dice out! I whipped out the bab ruler and measured 7cm in diameter, though the bab was flattened, why? The bab was toasted, which flattened it panini style with a golden brown  \nhue to boot . The toasting meant that the bab didn't fall apart and was pleasantly hot, but at a cost. The veggies were a little wilted from the heat and lacked good fresh flavour,especially the lettuce. The carrot was an interesting addition and added bit of sweetness to the proceedings. I got only small shavings of onion and I wanted more.\n\nNow, the meat was pre-carved and from a metal bain-marie, which makes sense as it was 2.00pm on a Saturday. The meat wasn't dry nor fatty and was heated by the warm wrap, but I couldn't taste much of it at all, more to come. The meat ratio to veggies was OK, though I would have liked more fresh veggies in the mix. I had two sauces which were chili and tomato. The sauces rounded each other nicely because the tomato softened the heat of the chili. Though the sauce did overpower the meat flavour and I didn't notice much meat flavour. The sauce wasn't runny,no spill and was evenly distributed through the bab. \n\nThe price was $9.50 which is not as much as some of the others out there, being under $10 and was relatively filling considering what you get. The bab is a 2/5 because of the meat, veggie and sauce issues though the price from what I've seen from of other kebabs in my reviews, is more reasonable which makes it a 3/5, so a 3/5 (for pricing sake).  In my mind a good kebab should fill you up and be affordable. \n\nThough what would you think about price vs taste? Do you take this into account? Something for the Bab Brigade to discuss! Or if you don't want to talk about money, try this!  Is toasting the outside of the bab good for you or not?\n\n&#x200B;\n\n&#x200B;\n\n[Store front](https://i.redd.it/4638w64duyn11.jpg)\n\n&#x200B;\n\n[2 free sauces also lamb is cheaper than chicken?](https://i.redd.it/k0jnwes3wyn11.jpg)\n\n[Check out the toasting and also the slightly wilted lettuce ](https://i.redd.it/ddr0me01vyn11.jpg)\n\n[Bitten bab](https://i.redd.it/zdfzduytuyn11.jpg)",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9i7oss/kberra_bab_blog_8_origin_kebabs_large_lamb_kebab/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9i7oss/kberra_bab_blog_8_origin_kebabs_large_lamb_kebab/",
      "category":""
   },
   {
      "title":"Short term accommodation for internship.",
      "body":"I am currently a masters student and got offered a really good internship opportunity in Canberra for 3 weeks during a period I will be back in Australia (I live in Germany).\n\nI have done a pretty extensive google search for accommodation and can't find anything that is under $2500 unless it is so far away I would spend tons getting an Uber twice a day.\n\nAs a last resort - is there anywhere in Canberra that you guys know of that could be an option? Because to be honest, at this point, even though it would be great for my career, I am tempted to turn it down because by the time I add in living expenses and flying there and back from my parents' home interstate where I'd spend the rest of the time, I could go on a holiday to South East Asia or somewhere in South America for less money rather than spending thousands to work for free.",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9i8omh/short_term_accommodation_for_internship/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9i8omh/short_term_accommodation_for_internship/",
      "category":""
   },
   {
      "title":"Hey guys weird question. Has anybody seen 3 black chooks wandering around the 2602 area?",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9i7e02/hey_guys_weird_question_has_anybody_seen_3_black/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9i7e02/hey_guys_weird_question_has_anybody_seen_3_black/",
      "category":""
   },
   {
      "title":"Woman forced to the ground, told not to scream in Barton knife-attack",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9i50zf/woman_forced_to_the_ground_told_not_to_scream_in/",
      "content_url":"https://www.brisbanetimes.com.au/national/act/woman-forced-to-the-ground-told-not-to-scream-in-barton-knife-attack-20180923-p505gw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
      "category":""
   },
   {
      "title":"What are some of the best pub lunches in/around Canberra?",
      "body":"“Best” being anything from value for money, quality, atmosphere, or all of the above. ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9i4pip/what_are_some_of_the_best_pub_lunches_inaround/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9i4pip/what_are_some_of_the_best_pub_lunches_inaround/",
      "category":""
   },
   {
      "title":"AFL 9s team in need of a few more",
      "body":"Any guys interested in playing touch AFL on Thursday nights in Phillip, starting in a couple weeks.\n\nAm fielding a team with some other blokes that have recently moved to Canberra and we're short a few.\n\nIt'll be about $10 a game and it's an amateur competition with a much softer rule-set than AFL, so you don't have to have much skill, just a bit of jog in ya.\n\n[http://afl9s.com.au/rules/](http://afl9s.com.au/rules/)\n\nShoot me a DM if you're keen.\n\nCheers,\n\n&#x200B;",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9i6rnb/afl_9s_team_in_need_of_a_few_more/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9i6rnb/afl_9s_team_in_need_of_a_few_more/",
      "category":""
   },
   {
      "title":"Tuggeranong cyclists targeted by wire in nature reserve",
      "body":"",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9hytqo/tuggeranong_cyclists_targeted_by_wire_in_nature/",
      "content_url":"https://www.canberratimes.com.au/canberra-news/tuggeranong-cyclists-targeted-by-wire-in-nature-reserve-20180922-p505f2.html",
      "category":""
   },
   {
      "title":"Canberra Christmas Lunch",
      "body":"So the Missus and I had the brilliant idea of getting both of our folks down for Xmas this year. Unfortunately our apartment won't hold 7 people for Christmas Lunch so I was wondering if anyone here had any experiences with the lunch spreads around the place? Is there anywhere to avoid or particularly nice hidden gems?",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9hypa2/canberra_christmas_lunch/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9hypa2/canberra_christmas_lunch/",
      "category":""
   },
   {
      "title":"Where are the cheap strawberries at?",
      "body":"Anyone seen $1/punnet or cheaper somewhere south of the city? It's jam making time. ",
      "is_video":false,
      "post_url":"www.reddit.com/r/canberra/comments/9hyo3y/where_are_the_cheap_strawberries_at/",
      "content_url":"https://www.reddit.com/r/canberra/comments/9hyo3y/where_are_the_cheap_strawberries_at/",
      "category":""
   }
]